{
  "columns": [
    {
      "id": 1,
      "direction": "down",
      "category": "Politics",
      "articles": [
        {
          "category": "Politics",
          "categoryColor": "secondary",
          "title": "Senate Committee Advances Landmark Infrastructure Bill",
          "author": "Margaret Chen",
          "date": "2025-10-14",
          "videoId": "dQw4w9WgXcQ",
          "trending": true,
          "trendingUntil": "2025-10-17T00:00:00Z",
          "content": [
            "After months of negotiations, bipartisan support emerges for comprehensive infrastructure package aimed at modernizing transportation networks and creating thousands of new jobs across the country.",
            "The legislation, which has been years in the making, represents one of the most significant investments in America's infrastructure since the Interstate Highway System.",
            "Key provisions include funding for roads, bridges, broadband expansion, and climate resilience initiatives. Economists predict substantial long-term economic benefits from the modernization efforts."
          ]
        },
        {
          "category": "Politics",
          "categoryColor": "secondary",
          "title": "Tech Giants Face New Regulatory Scrutiny",
          "author": "David Park",
          "date": "2025-10-13",
          "videoId": "dQw4w9WgXcQ",
          "content": [
            "Lawmakers propose sweeping changes to digital privacy laws as concerns mount over data collection practices and market dominance of major technology companies.",
            "The proposed regulations would fundamentally reshape how tech companies operate, introducing strict requirements for data transparency and user consent."
          ]
        },
        {
          "category": "Politics",
          "categoryColor": "accent",
          "title": "Revolutionary AI Model Transforms Creative Industries",
          "author": "Alex Thompson",
          "date": "2025-10-12",
          "content": [
            "A groundbreaking artificial intelligence system is reshaping how creative professionals work, offering unprecedented capabilities in content generation and design assistance.",
            "Industry experts demonstrate the technology's potential in this exclusive presentation, showcasing real-world applications across multiple creative fields."
          ],
          "videoId": "dQw4w9WgXcQ"
        },
        {
          "category": "Politics",
          "categoryColor": "secondary",
          "title": "City Council Approves New Park Development",
          "author": "Local Desk",
          "date": "2025-10-11",
          "videoId": "dQw4w9WgXcQ",
          "content": [
            "Downtown expansion includes green spaces and community centers in ambitious urban renewal project that aims to bring nature back to the city's core.",
            "The development will feature walking trails, playgrounds, and public art installations designed by local artists."
          ]
        }
      ]
    },
    {
      "id": 2,
      "direction": "up",
      "category": "Climate",
      "articles": [
        {
          "category": "Climate",
          "categoryColor": "accent",
          "title": "Historic Climate Accord Signed by 150 Nations",
          "author": "Elena Rodriguez",
          "date": "2025-10-15",
          "videoId": "dQw4w9WgXcQ",
          "trending": true,
          "trendingUntil": "2025-10-17T00:00:00Z",
          "content": [
            "World leaders convene to commit to ambitious emissions targets in effort to combat accelerating environmental changes. The landmark agreement represents a pivotal moment in international cooperation.",
            "Scientists and environmental advocates have praised the comprehensive nature of the accord, which includes binding commitments for carbon reduction, renewable energy adoption, and financial support for developing nations.",
            "The agreement comes after intensive negotiations spanning multiple continents and represents a unified global response to the climate crisis that has been decades in the making.",
            "Implementation begins next quarter with initial reporting requirements and verification mechanisms to ensure compliance across all participating nations."
          ]
        },
        {
          "category": "Climate",
          "categoryColor": "secondary",
          "title": "Renewable Energy Surpasses Coal in Power Generation",
          "author": "Robert Kim",
          "date": "2025-10-14",
          "videoId": "dQw4w9WgXcQ",
          "trending": true,
          "trendingUntil": "2025-10-17T00:00:00Z",
          "content": [
            "Solar and wind power installations reach historic highs as clean energy becomes more cost-effective than fossil fuels in most markets.",
            "Industry analysts predict this marks a permanent shift in the global energy landscape, with implications for jobs and economic development."
          ]
        },
        {
          "category": "Climate",
          "categoryColor": "secondary",
          "title": "Major Cities Pledge Carbon Neutrality by 2030",
          "author": "Sarah Williams",
          "date": "2025-10-13",
          "videoId": "dQw4w9WgXcQ",
          "trending": true,
          "trendingUntil": "2025-10-17T00:00:00Z",
          "content": [
            "Metropolitan areas worldwide commit to aggressive emissions reductions, implementing electric transit and green building standards.",
            "Urban planners are closely coordinating with climate scientists to ensure targets are achievable and measurable."
          ]
        }
      ]
    },
    {
      "id": 3,
      "direction": "down",
      "category": "Technology",
      "articles": [
        {
          "category": "Technology",
          "categoryColor": "secondary",
          "title": "Breakthrough in Quantum Computing Research",
          "author": "Dr. Lisa Wang",
          "date": "2025-10-15",
          "videoId": "dQw4w9WgXcQ",
          "trending": true,
          "trendingUntil": "2025-10-17T00:00:00Z",
          "content": [
            "Researchers achieve major milestone in quantum error correction, bringing practical quantum computers closer to reality than ever before.",
            "The breakthrough could revolutionize fields from drug discovery to cryptography, solving problems that are currently impossible for classical computers.",
            "Leading tech companies are already racing to commercialize the technology, with experts predicting widespread applications within the next decade."
          ]
        },
        {
          "category": "Technology",
          "categoryColor": "secondary",
          "title": "5G Networks Enable Smart City Infrastructure",
          "author": "Dr. James Mitchell",
          "date": "2025-10-14",
          "trending": true,
          "trendingUntil": "2025-10-17T00:00:00Z",
          "content": [
            "High-speed wireless connectivity transforms urban management with real-time data analytics for traffic, utilities, and emergency services.",
            "The implementation has shown significant improvements in response times and resource allocation efficiency."
          ],
          "videoId": "dQw4w9WgXcQ"
        },
        {
          "category": "Technology",
          "categoryColor": "secondary",
          "title": "Blockchain Revolutionizes Supply Chain Management",
          "author": "Amanda Foster",
          "date": "2025-10-13",
          "videoId": "dQw4w9WgXcQ",
          "content": [
            "Decentralized ledger technology enables unprecedented transparency in global logistics and inventory tracking systems.",
            "Early adopters report significant reductions in fraud and improved efficiency across their operations."
          ]
        }
      ]
    },
    {
      "id": 4,
      "direction": "up",
      "category": "Sports",
      "articles": [
        {
          "category": "Sports",
          "categoryColor": "secondary",
          "title": "Underdog Team Clinches Championship Title",
          "author": "Marcus Thompson",
          "date": "2025-10-15",
          "trending": true,
          "trendingUntil": "2025-10-17T00:00:00Z",
          "content": [
            "In a stunning upset, the season's lowest-ranked team defeats defending champions in dramatic finale that will be remembered for generations.",
            "The victory came down to the final seconds, with spectacular plays from previously unknown athletes who rose to the occasion when it mattered most.",
            "Fans flooded the streets in celebration as the city experienced its first championship win in over three decades, marking a historic moment for the franchise.",
            "Team management credits the success to a combination of strategic coaching decisions, player development, and unwavering community support throughout the challenging season."
          ],
          "videoId": "dQw4w9WgXcQ"
        },
        {
          "category": "Sports",
          "categoryColor": "secondary",
          "title": "Olympic Athlete Breaks World Record",
          "author": "Jessica Martinez",
          "date": "2025-10-14",
          "videoId": "dQw4w9WgXcQ",
          "trending": true,
          "trendingUntil": "2025-10-17T00:00:00Z",
          "content": [
            "Track and field sensation achieves unprecedented time in 100-meter sprint, breaking a record that stood for over a decade.",
            "Sports scientists attribute the achievement to revolutionary training methods and cutting-edge performance analysis."
          ]
        },
        {
          "category": "Sports",
          "categoryColor": "secondary",
          "title": "Major League Announces Expansion Teams",
          "author": "Thomas Anderson",
          "date": "2025-10-13",
          "videoId": "dQw4w9WgXcQ",
          "content": [
            "Professional league reveals plans for four new franchises across emerging markets, expanding global reach of the sport.",
            "The announcement includes state-of-the-art stadiums and community investment programs."
          ]
        }
      ]
    },
    {
      "id": 5,
      "direction": "down",
      "category": "Business",
      "articles": [
        {
          "category": "Business",
          "categoryColor": "secondary",
          "title": "Startup Valuations Soar Despite Market Volatility",
          "author": "Robert Kim",
          "date": "2025-10-15",
          "videoId": "dQw4w9WgXcQ",
          "trending": true,
          "trendingUntil": "2025-10-17T00:00:00Z",
          "content": [
            "Venture capital continues flowing to promising tech ventures as investors bet on post-pandemic innovation boom and transformative technologies.",
            "Industry analysts point to artificial intelligence, biotechnology, and sustainable energy sectors as driving forces behind unprecedented investment activity."
          ]
        },
        {
          "category": "Business",
          "categoryColor": "secondary",
          "title": "Corporate Mergers Reshape Industry Landscape",
          "author": "Michelle Lee",
          "date": "2025-10-14",
          "videoId": "dQw4w9WgXcQ",
          "content": [
            "Major consolidation wave transforms competitive dynamics as companies seek scale advantages in global marketplace.",
            "Regulatory bodies scrutinize deals to ensure fair competition while businesses argue efficiency gains benefit consumers."
          ]
        },
        {
          "category": "Business",
          "categoryColor": "secondary",
          "title": "E-Commerce Giants Report Record Growth",
          "author": "Daniel Chang",
          "date": "2025-10-13",
          "videoId": "dQw4w9WgXcQ",
          "content": [
            "Online retail platforms exceed quarterly projections as consumer shopping habits continue shift toward digital channels.",
            "Logistics innovations and same-day delivery capabilities drive customer satisfaction to new heights."
          ]
        }
      ]
    },
    {
      "id": 6,
      "direction": "up",
      "category": "Health",
      "articles": [
        {
          "category": "Health",
          "categoryColor": "secondary",
          "title": "New Medical Study Reveals Promising Treatment",
          "author": "Dr. James Mitchell",
          "date": "2025-10-15",
          "videoId": "dQw4w9WgXcQ",
          "trending": true,
          "trendingUntil": "2025-10-17T00:00:00Z",
          "content": [
            "Clinical trials show remarkable results for novel therapy targeting previously untreatable conditions, offering hope to millions of patients worldwide.",
            "The treatment has shown minimal side effects while demonstrating significant efficacy across diverse patient populations."
          ]
        },
        {
          "category": "Health",
          "categoryColor": "secondary",
          "title": "Mental Health Services Expand Nationwide",
          "author": "Dr. Sarah Cooper",
          "date": "2025-10-14",
          "videoId": "dQw4w9WgXcQ",
          "content": [
            "Healthcare providers increase access to counseling and psychiatric care through telehealth platforms and community centers.",
            "Insurance coverage improvements make mental health treatment more affordable for millions of families."
          ]
        },
        {
          "category": "Health",
          "categoryColor": "secondary",
          "title": "Breakthrough in Alzheimer's Research",
          "author": "Dr. Michael Torres",
          "date": "2025-10-13",
          "videoId": "dQw4w9WgXcQ",
          "content": [
            "Scientists identify new biomarkers for early detection of neurodegenerative disease, opening pathways for preventive interventions.",
            "Research teams worldwide collaborate on developing targeted therapies based on these groundbreaking findings."
          ]
        }
      ]
    }
  ]
}
